sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/login.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.login">
   <soapenv:Header/>
   <soapenv:Body>
     <sug:sugarcrmUrl>https://nyqcvr4839.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
     <sug:username>admin</sug:username>
     <sug:password>61BD60C60D9FB60CC8FC7767669D40A1</sug:password>
     <sug:version>1</sug:version>
     <sug:appname>app</sug:appname>
   </soapenv:Body>
</soapenv:Envelope>